{"config": [{"config": {"return_sequences": false, "go_backwards": false, "recurrent_dropout": 0.0, "dtype": "float32", "name": "lstm_1", "units": 512, "unit_forget_bias": true, "activation": "tanh", "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "unroll": false, "stateful": false, "recurrent_constraint": null, "recurrent_regularizer": null, "kernel_constraint": null, "use_bias": true, "batch_input_shape": [null, 350, 1], "implementation": 1, "trainable": true, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 1, "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Sequential"}